__file__ = 'plan'

#todo，针对web的计划
"""
1、个人简历需要有一份，进入详情页后应指向此简历页，也就是作者  -- 这个优先级最后了
2、/ 指向一个干净的首页，用于展示网站内容，博客数量，爬虫数量等 -- 这个优先级倒数第二了
3、详情页的暂时就只需要这四类，
-作者是简历
-补给站是文章，文章也要一直写，可以先写好word文章，后期怎么加减都还好
-爬虫工厂，这个就还需要部署线上爬虫了。这个我还真没接触过，需要把爬虫部署到Linux上把，需要好好学习
-炸裂特效，就是前端纯JS特效了啊
5、简历不着急写，后端知识，现在差不多可以往flask，Django骗一个，了解一下也是好的
7、添加简单的反爬，这种该如何实现，前段与后端
8、站内爬虫，是使用scrapy还是request呢，这个有点懵 -- 给爬虫添加启动命令，是否需要下载mongo，linux下定时启动爬虫指令，可以写两个模块。requests和scrapy的
"""

"""
4、搜索引擎也可能是一个小知识点，如何创建一个优秀的站内搜索引擎，是第三方插件还是自己实现一个呢，如何实现，可以写一个文章，nice
6、selenium模块是可以写一个抢票的吗，博客博客 -- 暂时放弃，能实现基本的登录功能
"""
